Repository: guirms/estuda-ai-api
Catalog: Presentation.Web/Utils/Languages/*.resx
Languages: es_es, pt_br, zh_cn

# Box
source: Bx
es_es: Cj
pt_br: Cx
zh_cn: 箱

# BoxPerHour
source: Bx/h
es_es: Cj/h
pt_br: Cx/h
zh_cn: 箱/时

source: Broken
es_es: Roto
pt_br: Quebrado
zh_cn: 破蛋

source: Cracked
es_es: Agrietado
pt_br: Trincado
zh_cn: 裂纹蛋

# DifferentDays
source: Search days cannot be different
es_es: Los días de búsqueda no pueden ser diferentes
pt_br: Os dias de busca não podem ser diferentes
zh_cn: 搜索天数不能不同

source: Dirty
es_es: Sucio
pt_br: Sujo
zh_cn: 脏蛋

source: Eggs
es_es: Huevos
pt_br: Ovos
zh_cn: 鸡蛋

source: Emergency
es_es: Emergencia
pt_br: Emergência
zh_cn: 紧急情况

# ErrorGettingEggResults
source: Error loading eggs data
es_es: Error al cargar datos de huevos
pt_br: Erro ao carregar dados de ovos
zh_cn: 加载鸡蛋数据时出错

# ErrorGettingMachineSchedules
source: Error loading machine programs
es_es: Error al cargar programas de máquina
pt_br: Erro ao carregar programações da máquina
zh_cn: 加载计算机程序时出错

# ErrorGettingProductionResults
source: Error loading production data
es_es: Error al cargar datos de producción
pt_br: Erro ao carregar dados de produção
zh_cn: 加载生产数据时出错

# ErrorSaving
source: Error when saving
es_es: Error al guardar
pt_br: Erro ao salvar
zh_cn: 保存时出错

source: Friday
es_es: Viernes
pt_br: Sexta-feira
zh_cn: 星期五

source: Industrial
zh_cn: 工业蛋

source: Insufficient outputs
es_es: Salidas insuficientes
pt_br: Saídas Insuficientes
zh_cn: 输出不足

source: Invalid category list
es_es: Lista de categorías no válida
pt_br: Lista de categorias inválida
zh_cn: 类别列表无效

# InvalidCharacters
source: There are invalid characters in the request
es_es: Hay caracteres inválidos en la solicitud
pt_br: Existem caracteres inválidos na requisição
zh_cn: 请求中包含无效字符

source: Jumbo
zh_cn: 特大号

source: Large
es_es: Grande
pt_br: Grande
zh_cn: 大号

source: Leaked
es_es: Agujereado
pt_br: Vazado
zh_cn: 流清蛋

source: Load Cell Error
es_es: Error de celda de carga
pt_br: Erro de célula de carga
zh_cn: 传感器误差

source: Monday
es_es: Lunes
pt_br: Segunda-feira
zh_cn: 星期一

source: No context found
es_es: No se encontró contexto
pt_br: Nenhum contexto econtrado
zh_cn: 未找到上下文

source: No egg categories found
es_es: No se encontraron categorías de huevo
pt_br: Nenhuma categoria de ovos encontrada
zh_cn: 未找到鸡蛋类别

# FileDescriptionError
source: Error fetching description document
es_es: Error al obtener el documento de descripción
pt_br: Erro ao buscar documento de descrição
zh_cn: 获取描述文档时出错

# NoMachineFound
source: No machines found
es_es: No se encontró ninguna máquina
pt_br: Nenhuma máquina encontrada
zh_cn: 找不到任何设备

source: No machine operation found
es_es: No se encontró ninguna operación de máquina
pt_br: Nenhuma operação de máquina encontrada
zh_cn: 找不到机器操作

# NoMachineScheduleFound
source: No time found
es_es: No se encontró tiempo
pt_br: Nenhum horário encontrado
zh_cn: 找不到时间

# NoShiftFound
source: No shifts found
es_es: No se encontraron turnos
pt_br: Nenhum turno encontrado
zh_cn: 未找到班次

# NoWeekScheduledFound
source: No weekly schedule found
es_es: No se encontró ningún horario semanal
pt_br: Nenhum horário semanal encontrado
zh_cn: 找不到周计划

source: Off
es_es: Apagado
pt_br: Desligado
zh_cn: 关闭

source: Operation
es_es: Operación
pt_br: Operação
zh_cn: 操作

source: Red
es_es: Rojo
pt_br: Vermelho
zh_cn: 红色

source: Remaining time
es_es: Tiempo restante
pt_br: Tempo restante
zh_cn: 剩余时间

source: Saturday
es_es: Sábado
pt_br: Sábado
zh_cn: 星期六

source: Scale
es_es: Escala
pt_br: Balança
zh_cn: 秤

# ScheduledStop
source: Scheduled stops
es_es: Paradas programadas
pt_br: Paradas programadas
zh_cn: 计划停止

# ScheduledStopConflict
source: Scheduled stop times conflict with another stop
es_es: Las horas de parada programadas entran en conflicto con otra parada
pt_br: Os horários de paradas programadas estão em conflito com outra parada
zh_cn: 计划停止时间与其他停止时间冲突

source: Shift A
es_es: Turno A
pt_br: Turno A
zh_cn: 班次A

source: Shift B
es_es: Turno B
pt_br: Turno B
zh_cn: 班次B

source: Shift C
es_es: Turno C
pt_br: Turno C
zh_cn: 班次C

# ShiftConflict
source: Shift schedules conflict with another shift
es_es: Los horarios de los turnos entran en conflicto con otro turno
pt_br: Os horários de turnos estão em conflito com outro turno
zh_cn: 班次安排与其他班次冲突

source: Shift D
es_es: Turno D
pt_br: Turno D
zh_cn: 班次D

source: Small
es_es: Pequeño
pt_br: Pequeno
zh_cn: 小号

source: Solenoid
es_es: Solenoide
pt_br: Solenóide
zh_cn: 电磁阀

source: Solenoid Error
es_es: Error de solenoide
pt_br: Erro de Solenóide
zh_cn: 电磁阀错误

source: Stand by
es_es: Maquina parada
pt_br: Máquina parada
zh_cn: 备用支持

# StartDateGreaterThanEndDate
source: The start date cannot be greater than the end date
es_es: La fecha de inicio no puede ser posterior a la fecha de finalización
pt_br: A data inicial não pode ser maior do que a data final
zh_cn: 开始日期不能大于结束日期

source: Stopped machine
es_es: Maquina parada
pt_br: Máquina parada
zh_cn: 机器停止

# StringLengthValidation
source: No name can exceed 15 characters
es_es: Ningún nombre puede exceder los 15 caracteres
pt_br: Nenhum nome pode ter mais de 15 caracteres
zh_cn: 任何名称都不能超过15个字符

source: Sunday
es_es: Domingo
pt_br: Domingo
zh_cn: 星期日

source: Super jumbo
zh_cn: 过大号

source: Thursday
es_es: Jueves
pt_br: Quinta-feira
zh_cn: 星期四

source: Total machine producing
es_es: Total de producción de la máquina
pt_br: Total de máquina produzindo
zh_cn: 机器总产量

source: Total unscheduled downtime
es_es: Total de paradas no programadas
pt_br: Total de paradas não programadas
zh_cn: 计划外停机时间总计

source: Tuesday
es_es: Martes
pt_br: Terça-feira
zh_cn: 星期二

# UnscheduledStop
source: Unscheduled stops
es_es: Paradas no programadas
pt_br: Paradas não programadas
zh_cn: 非计划停机

source: Wednesday
es_es: Miércoles
pt_br: Quarta-feira
zh_cn: 星期三

source: White
es_es: Blanco
pt_br: Branco
zh_cn: 白色

# DateFormat
source: yyyy-MM-dd
es_es: dd/MM/yyyy
pt_br: dd/MM/yyyy
zh_cn: 年-月-日

# TotalBoxesQuantity
source: Boxes quantity
es_es: Total de cajas
pt_br: Total de caixas
zh_cn: 箱子数量

# TotalEggsQuantity
source: Eggs quantity
es_es: Total de huevos
pt_br: Total de ovos
zh_cn: 鸡蛋数量

source: Total weight
es_es: Peso total
pt_br: Peso total
zh_cn: 总重量

source: Boxes
es_es: Cajas
pt_br: Caixas
zh_cn: 箱子数量

source: Category
es_es: Categoría
pt_br: Categoria
zh_cn: 类别

# EggResultsReportTitle
source: Production report
es_es: Informe de producción
pt_br: Relatório de produção
zh_cn: 生产报告

source: End date
es_es: Fecha final
pt_br: Data final
zh_cn: 结束日期

source: Quantity
es_es: Cantidad
pt_br: Quantidade
zh_cn: 数量

source: Start date
es_es: Fecha de inicio
pt_br: Data Inicial
zh_cn: 开始日期

source: Value
es_es: Valor
pt_br: Valor
zh_cn: 值

source: Weight
es_es: Peso
pt_br: Peso
zh_cn: 重量

# VisionSystemTitle
source: Vision system
es_es: Sistema de visión
pt_br: Sistema de visão
zh_cn: 视觉系统

# TotalEggsDataTitle
source: General data
es_es: Datos generales
pt_br: Dados gerais
zh_cn: 一般数据

# EggsProducedTitle
source: Eggs produced
es_es: Huevos producidos
pt_br: Ovos produzidos
zh_cn: 生产的鸡蛋

# ErrorValidatingShift
source: Shifts cannot be the same
es_es: Los turnos no pueden ser los mismos
pt_br: Os turnos não podem ser iguais
zh_cn: 班次不能相同

# InvalidUsername
source: The user name is invalid
es_es: El nombre de usuario no es válido
pt_br: O nome do usuário é inválido
zh_cn: 用户名无效

# InvalidUserPassword
source: The user password is invalid
es_es: La contraseña de usuario no es válida
pt_br: A senha do usuário é inválida
zh_cn: 用户密码无效

# ErrorLoggingIn
source: Error when logging in
es_es: Error al iniciar sesión
pt_br: Erro ao efetuar login
zh_cn: 登录时出错

# InvalidScheduledStopName
source: The scheduled stop name is invalido
es_es: El nombre de la parada programada no es válido
pt_br: O nome da parada programada é inválido
zh_cn: 计划的站点名称无效

source: Invalid username or password
es_es: Usuario o contraseña invalido
pt_br: Nome de usuário ou senha inválidos
zh_cn: 用户名或密码无效

source: Invalid CNPJ
es_es: CNPJ no válido
pt_br: CNPJ Inválido
zh_cn: 无效的CNPJ

# CustomerWithSameNameError
source: There is already a customer with that name
es_es: Ya existe un cliente con ese nombre
pt_br: Já existe um cliente com esse nome
zh_cn: 已经有一个客户使用该名称

# ErrorDeleting
source: Error when deleting
es_es: Error al borrar
pt_br: Erro ao deletar
zh_cn: 删除时出错

# ErrorUpdatingBatch
source: Error when updating shift
es_es: Error al actualizar el cambio
pt_br: Erro ao actualizar turno
zh_cn: 更新班次时出错

source: Error generating report file
es_es: Error al generar el archivo de informe
pt_br: Erro ao gerar arquivo de relatório
zh_cn: 生成报告文件时出错

source: Customer not found
es_es: Cliente no encontrado
pt_br: Cliente não encontrado
zh_cn: 未找到客户

# SameBatchError
source: The batches cannot be the same
es_es: Los lotes no pueden ser iguales
pt_br: Os lotes não podem ser iguais
zh_cn: 批次不能相同

source: No customers found
es_es: No se encontró ningún cliente
pt_br: Nenhum cliente encontrado
zh_cn: 未找到客户

source: Error communicating with external service
es_es: Error al comunicarse con el servicio externo
pt_br: Erro na comunicação com o serviço externo
zh_cn: 与外部服务通信时出错

source: Error starting batch
es_es: Error al iniciar lote
pt_br: Erro ao iniciar lote
zh_cn: 启动批处理时出错

# ErrorReceivingBatchConfirm
source: Error receiving batch confirmation
es_es: Error al recibir la confirmación del lote
pt_br: Erro recebendo confirmação de lote
zh_cn: 接收批次确认时出错

source: Register not found
es_es: Registro no encontrado
pt_br: Registro não encontrado
zh_cn: 注册没有找到

source: Batch not confirmed
es_es: Lote no confirmado
pt_br: Lote não confirmado
zh_cn: 批次未确认

source: Confirmed
es_es: Confirmado
pt_br: Confirmado
zh_cn: 确认

source: Disabled
es_es: Inactivo
pt_br: Inativo
zh_cn: 禁用

source: Started
es_es: Comenzó
pt_br: Iniciado
zh_cn: 开始

# UserSessionExpired
source: The user session has expired
es_es: La sesión del usuario ha caducado
pt_br: A sessão do usuário expirou
zh_cn: 用户时段已过期

source: User not found
es_es: Usuario no encontrado
pt_br: Usuário não encontrado
zh_cn: 找不到用户

source: Error stopping batch control
es_es: Error al detener el control de lotes
pt_br: Erro ao parar controle de lote
zh_cn: 停止批处理控制时出错

source: Invalid page
es_es: Página no válida
pt_br: Página inválida
zh_cn: 无效页面

source: Error applying filters
es_es: Error al aplicar filtros
pt_br: Erro ao aplicar filtros
zh_cn: 应用过滤器时出错

# ErrorSavingCredentials
source: Error saving credential
es_es: Error al guardar las credenciale
pt_br: Erro ao salvar credenciais
zh_cn: 保存凭据时出错

# ErrorGettingRequestIp
source: Error getting the request IP
es_es: Error al obtener la IP de la solicitud
pt_br: Erro ao encontrar o IP da requisição
zh_cn: 获取请求 IP 时出错

source: Invalid password
es_es: Contraseña no válida
pt_br: Senha inválida
zh_cn: 无效密码

source: Error validating credentials
es_es: Error al validar credenciales
pt_br: Erro ao validar credenciais
zh_cn: 验证凭据时出错

source: Invalid license
es_es: Licencia no válida
pt_br: Licença inválida
zh_cn: 无效许可证

source: No license found
es_es: No se encontró ninguna licencia
pt_br: Nenhuma licença encontrada
zh_cn: 未找到许可证

# ErrorGeneratingKey
source: Error generating license key
es_es: Error al generar la clave de licencia
pt_br: Erro ao gerar chave de licença
zh_cn: 生成许可证密钥时出错

source: Invalid email
es_es: Correo electrónico no válido
pt_br: E-mail inválido
zh_cn: 无效的电子邮件

source: Invalid license key
es_es: Clave de licencia no válida
pt_br: Chave de licença inválida
zh_cn: 无效的许可证密钥

source: Error recovering password
es_es: Error al recuperar la contraseña
pt_br: Erro ao recuperar senha
zh_cn: 恢复密码时出错

source: Error sending email
es_es: Error al enviar correo electrónico
pt_br: Erro ao enviar e-mail
zh_cn: 发送电子邮件时出错

source: Password recovery
es_es: Recuperación de contraseña
pt_br: Recuperação de senha
zh_cn: 密码恢复

source: Your recovery code is
es_es: Tu código de recuperación es
pt_br: Seu código de recuperação é
zh_cn: 您的恢复代码是

source: Invalid recovery code
es_es: Código de recuperación no válido
pt_br: Código de recuperação inválido
zh_cn: 无效的恢复代码

source: Invalid document
es_es: Documento no válido
pt_br: Documento inválido
zh_cn: 无效文档

# UserWithSameDocumentError
source: A user with this document already exists
es_es: Ya existe un usuario con este documento
pt_br: Já existe um usuário com esse documento
zh_cn: 已存在使用此文档的用户

# UserWithSameKeyError
source: A user with this key already exists
es_es: Ya existe un usuario con esta clave
pt_br: Já existe um usuário com essa chave
zh_cn: 已存在使用此密钥的用户

# UserWithSameEmailError
source: A user with this email already exists
es_es: Ya existe un usuario con este correo electrónico
pt_br: Já existe um usuário com esse e-mail
zh_cn: 已存在使用此电子邮件的用户

# PasswordMustContainUppercaseAndLowercase
source: Password must contain at least one lowercase and one uppercase letter
es_es: La contraseña debe contener al menos una letra minúscula y una mayúscula
pt_br: A senha deve conter pelo menos uma letra minúscula e maiúscula
zh_cn: 密码必须包含至少一个小写字母和一个大写字母

# PasswordMustHaveSpecialCharacter
source: Password must have at least one special character"
es_es: La contraseña debe tener al menos un carácter especial
pt_br: A senha deve ter pelo menos um caractere especial
zh_cn: 密码必须至少包含一个特殊字符

# PasswordMustHaveValidLength
source: Password must have between 8 and 50 characters
es_es: La contraseña debe tener entre 8 y 50 caracteres
pt_br: A senha deve ter entre 8 e 50 caracteres
zh_cn: 密码长度必须在8到50个字符之间

source: Passwords are not the same
es_es: Las contraseñas no son iguales
pt_br: As senhas não são iguais
zh_cn: 密码不相同

# InvalidLatitudeLongitude
source: Invalid latitude and longitude
es_es: Latitud y longitud no válidas
pt_br: Latitude e longitude inválidas
zh_cn: 无效的纬度和经度

source: Invalid ZIP code
es_es: Código postal no válido
pt_br: Código postal inválido
zh_cn: 无效的邮政编码

source: Error updating
es_es: Error al actualizar
pt_br: Erro ao atualizar
zh_cn: 更新时出错

# PlantNotFound
source: No plant found
es_es: No se encontró ninguna planta
pt_br: Nenhuma planta encontrada
zh_cn: 未找到任何植物

# PlantWithSameCnpjError
source: A plant with this CNPJ already exists
es_es: Ya existe una planta con este CNPJ
pt_br: Já existe uma planta com esse CNPJ
zh_cn: 已存在使用此CNPJ的植物

source: Invalid name
es_es: Nombre no válido
pt_br: Nome inválido
zh_cn: 无效名称

# PlantWithSameNameError
source: A plant with this name already exists
es_es: Ya existe una planta con este nombre
pt_br: Já existe uma planta com esse nome
zh_cn: 已存在使用此名称的植物

# DryerNotFound
source: No dryer found
es_es: No se encontró ninguna secadora
pt_br: Nenhuma secadora encontrada
zh_cn: 未找到烘干机

# EggWasherNotFound
source: No egg washer found
es_es: No se encontró ningún lavador de huevos
pt_br: Nenhum lavador de ovos encontrado
zh_cn: 未找到蛋洗机

# ModelNotFound
source: No model found
es_es: No se encontró ningún modelo
pt_br: Nenhum modelo encontrado
zh_cn: 未找到模型

# VisionSystemNotFound
source: No vision system found
es_es: No se encontró ningún sistema de visión
pt_br: Nenhum sistema de visão encontrado
zh_cn: 未找到视觉系统

source: Asset not found
es_es: Dominio no encontrada
pt_br: Domínio não encontrado
zh_cn: 未找到域

# WaitFiveMinutesToSendEmailAgain
source: Wait five minutes to send the email again
es_es: Espere cinco minutos para enviar el correo electrónico nuevamente
pt_br: Aguarde cinco minutos para enviar o e-mail novamente
zh_cn: 请等待五分钟后再次发送电子邮件

source: Asset already licensed
es_es: Dominio ya licenciada
pt_br: Domínio já licenciado
zh_cn: 域已许可

source: Error getting asset key
es_es: Error al obtener la clave del dominio
pt_br: Erro ao obter chave do domínio
zh_cn: 获取域密钥时出错

# InvalidAuthToken
source: Invalid authentication token
es_es: Token de autenticación no válido
pt_br: Token de autenticação inválido
zh_cn: 无效的身份验证令牌

source: User without permission
es_es: Usuario sin permisos
pt_br: Usuário sem permissão
zh_cn: 没有权限的用户

source: DontReply
es_es: No responder
pt_br: Não responda
zh_cn: 请勿回复

source: Error logging out
es_es: Error al cerrar sesión
pt_br: Erro ao encerrar sessão
zh_cn: 退出登录时出错

# TooManyRequestsWaitAMoment
source: Too many API requests. Please wait a moment
es_es: Demasiadas solicitudes a la API. Por favor, espere un momento
pt_br: Muitas requisições à API. Espere um momento
zh_cn: API请求过多。请稍候

# ErrorGeneratingUserKey
source: Error generating authentication ke
es_es: Error al generar la clave de autenticación
pt_br: Erro ao gerar chave de autenticação
zh_cn: 生成身份验证密钥时出错

source: Valid token already generated
es_es: Token válido ya generado
pt_br: Token válido já gerado
zh_cn: 有效的令牌已生成

source: Error getting plant schema
es_es: Error al obtener el esquema de planta
pt_br: Erro ao obter esquema de planta
zh_cn: 获取工厂模式时出错

# ErrorGettingSessionInfo
source: Error getting session information
es_es: Error al obtener información de la sesión
pt_br: Erro ao obter informações da sessão
zh_cn: 获取会话信息时出错

source: Layout not found
es_es: Diseño no encontrado
pt_br: Layout não encontrado
zh_cn: 未找到布局

source: Product not found
es_es: Producto no encontrado
pt_br: Produto não encontrado
zh_cn: 未找到产品

source: Invalid IP
es_es: IP inválida
pt_br: Ip inválida
zh_cn: 无效的IP
